
######################################################################
#                        SYSTEM NERD FONT                            #
######################################################################

cask "font-victor-mono-nerd-font"       # by Rubjo

# NOTE: other good fonts:
# cask "font-geist-mono-nerd-font"      # by Vercel
# cask "font-jetbrains-mono-nerd-font"  # by JetBrains
# cask "font-zed-mono-nerd-font"        # by Zed Industries
# cask "font-lilex-nerd-font"           # by IBM
# cask "font-monaspace-nf"              # by GitHub


######################################################################
#                      TERMINAL ENVIRONMENT                          #
######################################################################

# terminal emulator app
cask "ghostty"

# zsh shell and plugins
brew "zsh"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# builtin replacements
brew "zoxide"
brew "eza"
brew "bat"
brew "fd"
brew "xh"
brew "ripgrep"
brew "procs"

# utilities
brew "gnupg"
brew "ansible"
brew "stow"
brew "fzf"
brew "jq"
brew "awk"
brew "mas"
brew "chafa"
brew "tlrc"
brew "ledger"
brew "hyperfine"
brew "scc"
brew "speedtest-cli"
brew "yt-dlp"

# development
brew "docker"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "fnm"
brew "go"

# app plist changes monitoring tool (useful in automating app prefs)
go "github.com/catilac/plistwatch@latest"


######################################################################
#                             NEOVIM                                 #
######################################################################

brew "neovim"
brew "lua"
brew "luarocks"
brew "tree-sitter-cli"

######################################################################
#                          APPLICATIONS                              #
######################################################################

cask "raycast"
cask "alt-tab"
cask "hiddenbar"
cask "keyclu"
cask "betterdisplay"

# ai
cask "claude"
brew "claude-code"

# browsers
cask "google-chrome"

# notes
cask "notion"

# task management
cask "todoist-app"
cask "linear-linear"

# comms
cask "discord"
cask "telegram"
cask "slack"
cask "microsoft-teams"

# gaming
cask "steam"

# Mac App Store apps
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

# price tracking Safari extensions
mas "Keepa - Price Tracker", id: 1533805339
mas "The Camelizer", id: 1532579087


######################################################################
#                       VISUAL STUDIO CODE                           #
######################################################################

cask "visual-studio-code"

# vscode extensions
vscode "jdinhlife.gruvbox"                  # gruvbox color palette
vscode "vscodevim.vim"                      # VIM motions integration
vscode "johnpapa.vscode-cloak"              # hide sensitive info
vscode "eamodio.gitlens"                    # git integration
vscode "mikestead.dotenv"                   # .env files syntax highlighting
vscode "ms-azuretools.vscode-docker"        # the docker extension pack for vscode
vscode "ms-azuretools.vscode-containers"    # build, manage, and deploy conteinerized apps (installed by the above)
vscode "davidanson.vscode-markdownlint"     # linting for .md files
vscode "jock.svg"                           # SVG languagge support and previwer
vscode "kamikillerto.vscode-colorize"       # CSS color highlighting
vscode "ms-vscode.makefile-tools"           # makefile support 
vscode "redhat.vscode-yaml"                 # YAML language support
vscode "dbaeumer.vscode-eslint"             # ESlint integration for code linting
vscode "esbenp.prettier-vscode"             # Prettier integration for code formatting
vscode "christian-kohler.npm-intellisense"  # intellisense for npm modules
vscode "yoavbls.pretty-ts-errors"           # human-readable TS errors
vscode "vercel.turbo-vsc"                   # Turborepo LSP integration
vscode "a-h.templ"                          # templ syntax highlighting and LSP integration
vscode "arjun.swagger-viewer"               # Swgger and OpenAPI viewer and validator
vscode "bradlc.vscode-tailwindcss"          # intellisense for tailwind CSS
vscode "golang.go"                          # Go language support
vscode "jinliming2.vscode-go-template"      # syntax highlighing for go-template
vscode "otovo-oss.htmx-tags"                # autocompletion and docs for HTMX tags
vscode "craigrbroughton.htmx-attributes"    # autocompletion and docs for HTMX attributes
vscode "sumneko.lua"                        # Lua LSP integration
vscode "unifiedjs.vscode-mdx"               # MDX language support
vscode "mtxr.sqltools"                      # DBMS client for vscode
vscode "mtxr.sqltools-driver-mysql"         # SQLTools drivers for MySQL / MariaDB / TiDB
vscode "mariosangiorgio.ledger"             # linting for ledger files
