
# ------------------------------------------------------------------------------
# SYSTEM NERD FONTS
# ------------------------------------------------------------------------------

cask "font-victor-mono-nerd-font"       # by Rubjo
# cask "font-geist-mono-nerd-font"      # by Vercel
# cask "font-jetbrains-mono-nerd-font"  # by JetBrains
# cask "font-zed-mono-nerd-font"        # by Zed Industries
# cask "font-lilex-nerd-font"           # by IBM
# cask "font-monaspace-nf"              # by GitHub


# ------------------------------------------------------------------------------
# TERMINAL ENVIRONMENT
# ------------------------------------------------------------------------------

# terminal emulator
cask "ghostty"          # a cross-platform terminal emulator by Mitchell Hashimoto

# zsh shell and plugins
brew "zsh"                      # the shell
brew "starship"                 # cross-shell customizable prompt
brew "zsh-autosuggestions"      # history-based command completion for zsh shell
brew "zsh-syntax-highlighting"  # syntax highlighting for zsh shell
brew "sheeki03/tap/tirith"      # shell security layer that intercepts suspicious commands

# core tools
brew "zoxide"           # `cd` replacement
brew "eza"              # `ls` replacement
brew "bat"              # `cat` replacement
brew "fd"               # `find` alternative
brew "xh"               # `curl` alternative
brew "ripgrep"          # `grep` replacement
brew "procs"            # `ps` replacement
brew "gnupg"            # encryption and signing tool
brew "stow"             # symlinking manager for dotfiles
brew "fzf"              # general-purpose fuzzy finder

# utilities
brew "mas"              # Mac App Store CLI
brew "xan"              # command-line CSV processor and explorer
brew "jq"               # command-line JSON processor
brew "awk"              # text processing and data extraction tool
brew "tlrc"             # simplified TL;DR man pages
brew "chafa"            # image and video previewer in the terminal
brew "ledger"           # double-entry accounting system
brew "hyperfine"        # command-line benchmarking tool
brew "scc"              # fast lines-of-code counter with complexity metrics
brew "speedtest-cli"    # internet connection speed test
brew "yt-dlp"           # video and audio downloader (YouTube and more)

# development
brew "docker"           # containerization platform
brew "gh"               # GitHub CLI
brew "git"              # distributed version control system
brew "git-delta"        # syntax-highlighting pager for git diffs
brew "git-lfs"          # git extension for versioning large files
brew "gitleaks"         # secrets scanner for git repositories
brew "claude-code"      # Claude Code CLI (agentic coding assistant)
brew "fnm"              # faster `nvm` alternative
brew "go"               # Go language toolchain

go "github.com/catilac/plistwatch@latest" # plist changes monitoring tool


# ------------------------------------------------------------------------------
# NEOVIM
# ------------------------------------------------------------------------------

brew "neovim"           # the number one editor for developers
brew "lua"              # Lua scripting language (used in Neovim config)
brew "luarocks"         # Lua package manager
brew "tree-sitter-cli"  # parser generator (used for Neovim syntax highlighting)

# ------------------------------------------------------------------------------
# APPLICATIONS
# ------------------------------------------------------------------------------

# my workflow core apps
cask "raycast"          # Spotlight replacement (and much more...)
cask "alt-tab"          # alt-tab window switcher
cask "hiddenbar"        # menu bar customization tool
cask "todoist-app"      # cross-platform personal task manager

# other personal apps
cask "claude"           # Anthropic's Claude desktop app
cask "keyclu"           # keyboard shortcuts cheat sheet overlay
cask "betterdisplay"    # display management and custom resolution utility
cask "google-chrome"    # standard browser for web dev
cask "discord"          # communties' comms platform
cask "telegram"         # messaging app
cask "steam"            # PC gaming platform

# work-specific apps
cask "notion"           # wiki, notes, and docs
cask "linear-linear"    # project management tool
cask "slack"            # team messaging app
cask "microsoft-teams"  # team meetings app

# Mac App Store apps
mas "Pages", id: 409201541        # Apple's word processor app
mas "Keynote", id: 409183694      # Apple's presentation app

# safari extensions
mas "Keepa - Price Tracker", id: 1533805339   # Amazon price history tracker
mas "The Camelizer", id: 1532579087           # Amazon price history tracker


# ------------------------------------------------------------------------------
# VISUAL STUDIO CODE
# ------------------------------------------------------------------------------

# the editor
cask "visual-studio-code"

# vscode extensions
vscode "jdinhlife.gruvbox"                  # gruvbox color palette
vscode "vscodevim.vim"                      # VIM motions integration
vscode "johnpapa.vscode-cloak"              # hide sensitive info
vscode "eamodio.gitlens"                    # git integration
vscode "mikestead.dotenv"                   # .env files syntax highlighting
vscode "ms-azuretools.vscode-docker"        # the docker extension pack for vscode
vscode "ms-azuretools.vscode-containers"    # build, manage, and deploy conteinerized apps (installed by the above)
vscode "davidanson.vscode-markdownlint"     # linting for .md files
vscode "jock.svg"                           # SVG languagge support and previwer
vscode "kamikillerto.vscode-colorize"       # CSS color highlighting
vscode "ms-vscode.makefile-tools"           # makefile support
vscode "redhat.vscode-yaml"                 # YAML language support
vscode "dbaeumer.vscode-eslint"             # ESlint integration for code linting
vscode "esbenp.prettier-vscode"             # Prettier integration for code formatting
vscode "christian-kohler.npm-intellisense"  # intellisense for npm modules
vscode "yoavbls.pretty-ts-errors"           # human-readable TS errors
vscode "vercel.turbo-vsc"                   # Turborepo LSP integration
vscode "a-h.templ"                          # templ syntax highlighting and LSP integration
vscode "arjun.swagger-viewer"               # Swgger and OpenAPI viewer and validator
vscode "bradlc.vscode-tailwindcss"          # intellisense for tailwind CSS
vscode "golang.go"                          # Go language support
vscode "jinliming2.vscode-go-template"      # syntax highlighing for go-template
vscode "otovo-oss.htmx-tags"                # autocompletion and docs for HTMX tags
vscode "craigrbroughton.htmx-attributes"    # autocompletion and docs for HTMX attributes
vscode "sumneko.lua"                        # Lua LSP integration
vscode "unifiedjs.vscode-mdx"               # MDX language support
vscode "mtxr.sqltools"                      # DBMS client for vscode
vscode "mtxr.sqltools-driver-mysql"         # SQLTools drivers for MySQL / MariaDB / TiDB
vscode "mariosangiorgio.ledger"             # linting for ledger files
